let data = [
    {
        "板块名称": "人北片区",
        "低支付力": "0.0000 ",
        "中支付力": "0.3558 ",
        "中高支付力": "0.5976 ",
        "高支付力": "0.0466 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "电子科大-新华公园",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.9959 ",
        "高支付力": "0.0041 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "春熙路片区",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.6667 ",
        "高支付力": "0.3333 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新南天地",
        "低支付力": "0.0000 ",
        "中支付力": "0.4386 ",
        "中高支付力": "0.5614 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "茶店子",
        "低支付力": "0.0000 ",
        "中支付力": "0.0622 ",
        "中高支付力": "0.7949 ",
        "高支付力": "0.1187 ",
        "TOP支付力": "0.0242 "
    },
    {
        "板块名称": "八里庄",
        "低支付力": "0.0000 ",
        "中支付力": "0.0374 ",
        "中高支付力": "0.9626 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "万年场",
        "低支付力": "0.0000 ",
        "中支付力": "0.9436 ",
        "中高支付力": "0.0313 ",
        "高支付力": "0.0063 ",
        "TOP支付力": "0.0188 "
    },
    {
        "板块名称": "金融城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0844 ",
        "中高支付力": "0.3506 ",
        "高支付力": "0.5095 ",
        "TOP支付力": "0.0555 "
    },
    {
        "板块名称": "武侯新城",
        "低支付力": "0.0000 ",
        "中支付力": "0.1197 ",
        "中高支付力": "0.8507 ",
        "高支付力": "0.0276 ",
        "TOP支付力": "0.0020 "
    },
    {
        "板块名称": "外光华",
        "低支付力": "0.0249 ",
        "中支付力": "0.0686 ",
        "中高支付力": "0.8459 ",
        "高支付力": "0.0570 ",
        "TOP支付力": "0.0036 "
    },
    {
        "板块名称": "三圣乡",
        "低支付力": "0.0000 ",
        "中支付力": "0.0933 ",
        "中高支付力": "0.6321 ",
        "高支付力": "0.2003 ",
        "TOP支付力": "0.0743 "
    },
    {
        "板块名称": "西部智谷",
        "低支付力": "0.0000 ",
        "中支付力": "0.1370 ",
        "中高支付力": "0.8170 ",
        "高支付力": "0.0460 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "外金沙",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.9988 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0012 "
    },
    {
        "板块名称": "十陵",
        "低支付力": "0.0000 ",
        "中支付力": "0.3121 ",
        "中高支付力": "0.6776 ",
        "高支付力": "0.0103 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "国宾",
        "低支付力": "0.0000 ",
        "中支付力": "0.3827 ",
        "中高支付力": "0.6099 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0074 "
    },
    {
        "板块名称": "龙潭寺",
        "低支付力": "0.0000 ",
        "中支付力": "0.9974 ",
        "中高支付力": "0.0026 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "北湖",
        "低支付力": "0.0000 ",
        "中支付力": "0.9043 ",
        "中高支付力": "0.0957 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "攀成钢",
        "低支付力": "0.0000 ",
        "中支付力": "0.0448 ",
        "中高支付力": "0.6399 ",
        "高支付力": "0.1858 ",
        "TOP支付力": "0.1295 "
    },
    {
        "板块名称": "东客站",
        "低支付力": "0.0000 ",
        "中支付力": "0.5416 ",
        "中高支付力": "0.3260 ",
        "高支付力": "0.1324 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "动物园-青龙场",
        "低支付力": "0.0000 ",
        "中支付力": "0.9920 ",
        "中高支付力": "0.0080 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "崔家店",
        "低支付力": "0.0000 ",
        "中支付力": "0.0731 ",
        "中高支付力": "0.9269 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "成都理工",
        "低支付力": "0.0000 ",
        "中支付力": "0.5612 ",
        "中高支付力": "0.3755 ",
        "高支付力": "0.0633 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "大源",
        "低支付力": "0.0000 ",
        "中支付力": "0.0819 ",
        "中高支付力": "0.8447 ",
        "高支付力": "0.0720 ",
        "TOP支付力": "0.0014 "
    },
    {
        "板块名称": "北中和",
        "低支付力": "0.0000 ",
        "中支付力": "0.3854 ",
        "中高支付力": "0.6146 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "南中和",
        "低支付力": "0.0000 ",
        "中支付力": "0.0051 ",
        "中高支付力": "0.9942 ",
        "高支付力": "0.0007 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新川",
        "低支付力": "0.0000 ",
        "中支付力": "0.1907 ",
        "中高支付力": "0.6957 ",
        "高支付力": "0.1072 ",
        "TOP支付力": "0.0063 "
    },
    {
        "板块名称": "龙泉城区",
        "低支付力": "0.0000 ",
        "中支付力": "0.8411 ",
        "中高支付力": "0.1589 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "双流城区",
        "低支付力": "0.6119 ",
        "中支付力": "0.3839 ",
        "中高支付力": "0.0042 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "华阳",
        "低支付力": "0.4389 ",
        "中支付力": "0.4962 ",
        "中高支付力": "0.0076 ",
        "高支付力": "0.0573 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "麓山",
        "低支付力": "0.2644 ",
        "中支付力": "0.6888 ",
        "中高支付力": "0.0272 ",
        "高支付力": "0.0167 ",
        "TOP支付力": "0.0029 "
    },
    {
        "板块名称": "秦皇寺",
        "低支付力": "0.0285 ",
        "中支付力": "0.6346 ",
        "中高支付力": "0.3078 ",
        "高支付力": "0.0291 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "麓湖",
        "低支付力": "0.0000 ",
        "中支付力": "0.4552 ",
        "中高支付力": "0.5069 ",
        "高支付力": "0.0280 ",
        "TOP支付力": "0.0100 "
    },
    {
        "板块名称": "科学城",
        "低支付力": "0.1296 ",
        "中支付力": "0.6770 ",
        "中高支付力": "0.1842 ",
        "高支付力": "0.0092 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "锦江生态带",
        "低支付力": "0.0000 ",
        "中支付力": "0.9885 ",
        "中高支付力": "0.0006 ",
        "高支付力": "0.0016 ",
        "TOP支付力": "0.0093 "
    },
    {
        "板块名称": "天府华府",
        "低支付力": "0.2409 ",
        "中支付力": "0.7193 ",
        "中高支付力": "0.0399 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "大面",
        "低支付力": "0.0000 ",
        "中支付力": "0.4015 ",
        "中高支付力": "0.5445 ",
        "高支付力": "0.0520 ",
        "TOP支付力": "0.0019 "
    },
    {
        "板块名称": "东安湖",
        "低支付力": "0.0000 ",
        "中支付力": "0.4839 ",
        "中高支付力": "0.5161 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "双流北",
        "低支付力": "0.8255 ",
        "中支付力": "0.1596 ",
        "中高支付力": "0.0148 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "文产学院",
        "低支付力": "0.2969 ",
        "中支付力": "0.7007 ",
        "中高支付力": "0.0024 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "双流华府",
        "低支付力": "0.2197 ",
        "中支付力": "0.6162 ",
        "中高支付力": "0.1602 ",
        "高支付力": "0.0018 ",
        "TOP支付力": "0.0021 "
    },
    {
        "板块名称": "天府芯谷",
        "低支付力": "0.3761 ",
        "中支付力": "0.6072 ",
        "中高支付力": "0.0167 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "怡心湖",
        "低支付力": "0.0000 ",
        "中支付力": "1.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "兴隆",
        "低支付力": "0.3466 ",
        "中支付力": "0.5766 ",
        "中高支付力": "0.0754 ",
        "高支付力": "0.0014 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "东湖",
        "低支付力": "0.0000 ",
        "中支付力": "0.0109 ",
        "中高支付力": "0.9837 ",
        "高支付力": "0.0054 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "丽都",
        "低支付力": "0.0000 ",
        "中支付力": "0.1615 ",
        "中高支付力": "0.8385 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "天回",
        "低支付力": "0.0000 ",
        "中支付力": "0.9917 ",
        "中高支付力": "0.0083 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "西平",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "机投",
        "低支付力": "0.0000 ",
        "中支付力": "0.1734 ",
        "中高支付力": "0.6185 ",
        "高支付力": "0.0694 ",
        "TOP支付力": "0.1387 "
    },
    {
        "板块名称": "青白江老城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "凤凰新城",
        "低支付力": "0.9999 ",
        "中支付力": "0.0001 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "大丰",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "毗河",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "白家",
        "低支付力": "0.5000 ",
        "中支付力": "0.5000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "万安",
        "低支付力": "0.3810 ",
        "中支付力": "0.6190 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "幸福梅林",
        "低支付力": "0.0000 ",
        "中支付力": "0.0351 ",
        "中高支付力": "0.6491 ",
        "高支付力": "0.0877 ",
        "TOP支付力": "0.2281 "
    },
    {
        "板块名称": "浣花溪",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.9139 ",
        "TOP支付力": "0.0861 "
    },
    {
        "板块名称": "人南片区",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.7638 ",
        "高支付力": "0.2362 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "洪河",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "内金沙",
        "低支付力": "0.0000 ",
        "中支付力": "0.1126 ",
        "中高支付力": "0.6341 ",
        "高支付力": "0.2483 ",
        "TOP支付力": "0.0050 "
    },
    {
        "板块名称": "琉璃厂",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.9037 ",
        "高支付力": "0.0963 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "营门口片区",
        "低支付力": "0.0000 ",
        "中支付力": "1.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "青龙湖",
        "低支付力": "0.0000 ",
        "中支付力": "0.4270 ",
        "中高支付力": "0.5730 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "内光华",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.9758 ",
        "TOP支付力": "0.0242 "
    },
    {
        "板块名称": "川师",
        "低支付力": "0.0000 ",
        "中支付力": "0.0022 ",
        "中高支付力": "0.9845 ",
        "高支付力": "0.0066 ",
        "TOP支付力": "0.0066 "
    },
    {
        "板块名称": "书房",
        "低支付力": "0.0000 ",
        "中支付力": "0.9934 ",
        "中高支付力": "0.0066 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "东城根片区",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "东大街",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0226 ",
        "高支付力": "0.4221 ",
        "TOP支付力": "0.5553 "
    },
    {
        "板块名称": "非遗",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "红牌楼",
        "低支付力": "0.0000 ",
        "中支付力": "0.1190 ",
        "中高支付力": "0.8778 ",
        "高支付力": "0.0032 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "熊猫基地",
        "低支付力": "0.0000 ",
        "中支付力": "0.9960 ",
        "中高支付力": "0.0040 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "沙北",
        "低支付力": "0.0000 ",
        "中支付力": "0.6384 ",
        "中高支付力": "0.3616 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "沙西",
        "低支付力": "0.0000 ",
        "中支付力": "1.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "火车北站",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "公兴",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "同安",
        "低支付力": "0.9936 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0019 ",
        "TOP支付力": "0.0045 "
    },
    {
        "板块名称": "洛带",
        "低支付力": "0.9333 ",
        "中支付力": "0.0667 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "侯家",
        "低支付力": "0.0000 ",
        "中支付力": "0.6401 ",
        "中高支付力": "0.3599 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "驷马桥",
        "低支付力": "0.0000 ",
        "中支付力": "0.9626 ",
        "中高支付力": "0.0374 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "北部物流港",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "锦江工业园",
        "低支付力": "0.0000 ",
        "中支付力": "0.0920 ",
        "中高支付力": "0.9080 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "金花",
        "低支付力": "0.9976 ",
        "中支付力": "0.0024 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "西河",
        "低支付力": "0.9969 ",
        "中支付力": "0.0031 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙都北路",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "江安",
        "低支付力": "0.9988 ",
        "中支付力": "0.0012 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "双楠片区",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.5714 ",
        "高支付力": "0.4286 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "机场路",
        "低支付力": "0.0000 ",
        "中支付力": "1.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "温江北",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "两河遗址",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0833 ",
        "高支付力": "0.9167 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "外双楠",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "欢乐谷",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0650 ",
        "TOP支付力": "0.9350 "
    },
    {
        "板块名称": "新都新城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "北部商贸城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "天府生物城",
        "低支付力": "0.4413 ",
        "中支付力": "0.5587 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "科学城南",
        "低支付力": "0.0000 ",
        "中支付力": "0.8074 ",
        "中高支付力": "0.1926 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "光华新城",
        "低支付力": "0.4577 ",
        "中支付力": "0.5308 ",
        "中高支付力": "0.0016 ",
        "高支付力": "0.0071 ",
        "TOP支付力": "0.0028 "
    },
    {
        "板块名称": "犀浦",
        "低支付力": "0.7510 ",
        "中支付力": "0.2476 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0014 "
    },
    {
        "板块名称": "街子",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "郫县城区",
        "低支付力": "0.8851 ",
        "中支付力": "0.1146 ",
        "中高支付力": "0.0001 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0001 "
    },
    {
        "板块名称": "安靖",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "1.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "青城山",
        "低支付力": "0.8497 ",
        "中支付力": "0.0870 ",
        "中高支付力": "0.0621 ",
        "高支付力": "0.0012 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "绕外高西区",
        "低支付力": "0.9404 ",
        "中支付力": "0.0596 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新津-牧马山",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "九江",
        "低支付力": "0.7388 ",
        "中支付力": "0.2571 ",
        "中高支付力": "0.0041 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "河东新区",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "邛崃城区",
        "低支付力": "0.9912 ",
        "中支付力": "0.0077 ",
        "中高支付力": "0.0009 ",
        "高支付力": "0.0002 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新都老城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "红光",
        "低支付力": "0.9715 ",
        "中支付力": "0.0285 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "温江城区",
        "低支付力": "0.9985 ",
        "中支付力": "0.0015 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新津城区",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "崇州城区",
        "低支付力": "0.9944 ",
        "中支付力": "0.0056 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "彭州城区",
        "低支付力": "0.9998 ",
        "中支付力": "0.0002 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "都江堰城区",
        "低支付力": "0.9941 ",
        "中支付力": "0.0035 ",
        "中高支付力": "0.0025 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "金堂大学城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "金堂城区",
        "低支付力": "0.9981 ",
        "中支付力": "0.0014 ",
        "中高支付力": "0.0005 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "大邑城区",
        "低支付力": "0.9960 ",
        "中支付力": "0.0031 ",
        "中高支付力": "0.0008 ",
        "高支付力": "0.0001 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "198板块",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "玉堂",
        "低支付力": "0.9908 ",
        "中支付力": "0.0088 ",
        "中高支付力": "0.0002 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0001 "
    },
    {
        "板块名称": "双流-牧马山",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.1188 ",
        "TOP支付力": "0.8812 "
    },
    {
        "板块名称": "清流",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "五凤溪",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙马湖",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "德源",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "柳林",
        "低支付力": "0.5492 ",
        "中支付力": "0.4360 ",
        "中高支付力": "0.0147 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "花水湾",
        "低支付力": "0.8161 ",
        "中支付力": "0.1839 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "安仁",
        "低支付力": "0.5238 ",
        "中支付力": "0.3333 ",
        "中高支付力": "0.1429 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "三道堰",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "安德",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "友爱",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "蒲江寿安",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "彭州工业园",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "羊安新城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "普兴",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新繁",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "金马",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙桥",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "北部新城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "木兰",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "国际铁路港",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "蒲江城区",
        "低支付力": "0.9997 ",
        "中支付力": "0.0003 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "斑竹园",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "团结",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "南部新区(彭州)",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙门山",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "濛阳",
        "低支付力": "0.9997 ",
        "中支付力": "0.0003 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "简阳老城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "唐昌",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙泉湖",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "淮洲新城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "军屯",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "羊马新城",
        "低支付力": "0.9993 ",
        "中支付力": "0.0007 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "永商",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "和盛",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "永宁",
        "低支付力": "0.9922 ",
        "中支付力": "0.0029 ",
        "中高支付力": "0.0049 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "车城",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "万春",
        "低支付力": "0.9968 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0024 ",
        "TOP支付力": "0.0008 "
    },
    {
        "板块名称": "泰兴",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "空天产业园",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "温江寿安",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "双流机场",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.4595 ",
        "TOP支付力": "0.5405 "
    },
    {
        "板块名称": "空港产业区",
        "低支付力": "0.3677 ",
        "中支付力": "0.6323 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "简阳文教",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "简阳老工业园",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "高铁新城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "海螺镇",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "贾家",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "丹景台",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "三岔",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "未来科技城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "空港新城",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "植物园",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "凤凰山",
        "低支付力": "0.0445 ",
        "中支付力": "0.9040 ",
        "中高支付力": "0.0515 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "洪安",
        "低支付力": "0.9940 ",
        "中支付力": "0.0060 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "龙泉山",
        "低支付力": "0.9912 ",
        "中支付力": "0.0059 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0010 ",
        "TOP支付力": "0.0020 "
    },
    {
        "板块名称": "清水河片区",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "欧洲产业城",
        "低支付力": "0.9923 ",
        "中支付力": "0.0063 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0007 ",
        "TOP支付力": "0.0007 "
    },
    {
        "板块名称": "文家",
        "低支付力": "0.7778 ",
        "中支付力": "0.0030 ",
        "中高支付力": "0.2192 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "成飞",
        "低支付力": "0.0000 ",
        "中支付力": "0.0359 ",
        "中高支付力": "0.8886 ",
        "高支付力": "0.0718 ",
        "TOP支付力": "0.0037 "
    },
    {
        "板块名称": "平乐",
        "低支付力": "1.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "蛟龙港",
        "低支付力": "0.6783 ",
        "中支付力": "0.3135 ",
        "中高支付力": "0.0082 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "彭镇",
        "低支付力": "0.3761 ",
        "中支付力": "0.6072 ",
        "中高支付力": "0.0167 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "黄水",
        "低支付力": "0.3574 ",
        "中支付力": "0.5771 ",
        "中高支付力": "0.0164 ",
        "高支付力": "0.0058 ",
        "TOP支付力": "0.0434 "
    },
    {
        "板块名称": "黄甲",
        "低支付力": "0.5893 ",
        "中支付力": "0.3436 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0173 ",
        "TOP支付力": "0.0499 "
    },
    {
        "板块名称": "永安",
        "低支付力": "0.4412 ",
        "中支付力": "0.5588 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "太平寺",
        "低支付力": "0.0869 ",
        "中支付力": "0.1094 ",
        "中高支付力": "0.7786 ",
        "高支付力": "0.0234 ",
        "TOP支付力": "0.0017 "
    },
    {
        "板块名称": "石板滩",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新津绿心",
        "低支付力": "0.0000 ",
        "中支付力": "0.0000 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "桐梓林",
        "低支付力": "0.0000 ",
        "中支付力": "0.0244 ",
        "中高支付力": "0.9756 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "煎茶",
        "低支付力": "0.0567 ",
        "中支付力": "0.8421 ",
        "中高支付力": "0.0915 ",
        "高支付力": "0.0048 ",
        "TOP支付力": "0.0048 "
    },
    {
        "板块名称": "天府文创城",
        "低支付力": "0.0000 ",
        "中支付力": "0.8074 ",
        "中高支付力": "0.1926 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "籍田",
        "低支付力": "0.0000 ",
        "中支付力": "0.8074 ",
        "中高支付力": "0.1926 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "新兴产业园",
        "低支付力": "0.3799 ",
        "中支付力": "0.6201 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "鹿溪",
        "低支付力": "0.3580 ",
        "中支付力": "0.5903 ",
        "中高支付力": "0.0506 ",
        "高支付力": "0.0011 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "太平",
        "低支付力": "0.3810 ",
        "中支付力": "0.6190 ",
        "中高支付力": "0.0000 ",
        "高支付力": "0.0000 ",
        "TOP支付力": "0.0000 "
    },
    {
        "板块名称": "天府新站",
        "低支付力": "0.1148 ",
        "中支付力": "0.6915 ",
        "中高支付力": "0.1853 ",
        "高支付力": "0.0085 ",
        "TOP支付力": "0.0000"
    }
]

let dataMap = data.reduce((res,next) => {
    let value = [next['低支付力'],next['中支付力'],next['中高支付力'],next['高支付力'],next['TOP支付力']]
    value = value.map(item => {
         return Number(item)
    })
    res[next['板块名称']] = value
    return res
},{})

console.log(dataMap);