let map = [
    {
        "板块名字": "198板块",
        "行政区": "新都区"
    },
    {
        "板块名字": "安德",
        "行政区": "郫都区"
    },
    {
        "板块名字": "安靖",
        "行政区": "郫都区"
    },
    {
        "板块名字": "安仁",
        "行政区": "大邑县"
    },
    {
        "板块名字": "八里庄",
        "行政区": "成华区"
    },
    {
        "板块名字": "白家",
        "行政区": "双流区"
    },
    {
        "板块名字": "斑竹园",
        "行政区": "新都区"
    },
    {
        "板块名字": "北部商贸城",
        "行政区": "金牛区"
    },
    {
        "板块名字": "北部物流港",
        "行政区": "新都区"
    },
    {
        "板块名字": "北部新城",
        "行政区": "简阳市"
    },
    {
        "板块名字": "北湖",
        "行政区": "成华区"
    },
    {
        "板块名字": "北中和",
        "行政区": "高新南区"
    },
    {
        "板块名字": "茶店子",
        "行政区": "金牛区"
    },
    {
        "板块名字": "车城",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "成都理工",
        "行政区": "成华区"
    },
    {
        "板块名字": "成飞",
        "行政区": "青羊区"
    },
    {
        "板块名字": "崇州城区",
        "行政区": "崇州市"
    },
    {
        "板块名字": "川师",
        "行政区": "锦江区"
    },
    {
        "板块名字": "春熙路片区",
        "行政区": "锦江区"
    },
    {
        "板块名字": "崔家店",
        "行政区": "成华区"
    },
    {
        "板块名字": "大丰",
        "行政区": "新都区"
    },
    {
        "板块名字": "大面",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "大邑城区",
        "行政区": "大邑县"
    },
    {
        "板块名字": "大源",
        "行政区": "高新南区"
    },
    {
        "板块名字": "丹景台",
        "行政区": "简阳市"
    },
    {
        "板块名字": "德源",
        "行政区": "郫都区"
    },
    {
        "板块名字": "电子科大-新华公园",
        "行政区": "成华区"
    },
    {
        "板块名字": "东安湖",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "东城根片区",
        "行政区": "青羊区"
    },
    {
        "板块名字": "东大街",
        "行政区": "锦江区"
    },
    {
        "板块名字": "东湖",
        "行政区": "锦江区"
    },
    {
        "板块名字": "东客站",
        "行政区": "成华区"
    },
    {
        "板块名字": "动物园-青龙场",
        "行政区": "成华区"
    },
    {
        "板块名字": "都江堰城区",
        "行政区": "都江堰市"
    },
    {
        "板块名字": "非遗",
        "行政区": "青羊区"
    },
    {
        "板块名字": "凤凰山",
        "行政区": "金牛区"
    },
    {
        "板块名字": "凤凰新城",
        "行政区": "青白江区"
    },
    {
        "板块名字": "高铁新城",
        "行政区": "简阳市"
    },
    {
        "板块名字": "公兴",
        "行政区": "双流区"
    },
    {
        "板块名字": "光华新城",
        "行政区": "温江区"
    },
    {
        "板块名字": "国宾",
        "行政区": "金牛区"
    },
    {
        "板块名字": "国际铁路港",
        "行政区": "青白江区"
    },
    {
        "板块名字": "海螺镇",
        "行政区": "高新东区"
    },
    {
        "板块名字": "和盛",
        "行政区": "温江区"
    },
    {
        "板块名字": "河东新区",
        "行政区": "简阳市"
    },
    {
        "板块名字": "红光",
        "行政区": "郫都区"
    },
    {
        "板块名字": "红牌楼",
        "行政区": "武侯区"
    },
    {
        "板块名字": "洪安",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "洪河",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "侯家",
        "行政区": "金牛区"
    },
    {
        "板块名字": "花水湾",
        "行政区": "大邑县"
    },
    {
        "板块名字": "华阳",
        "行政区": "天府新区"
    },
    {
        "板块名字": "淮洲新城",
        "行政区": "金堂县"
    },
    {
        "板块名字": "欢乐谷",
        "行政区": "金牛区"
    },
    {
        "板块名字": "浣花溪",
        "行政区": "青羊区"
    },
    {
        "板块名字": "黄甲",
        "行政区": "双流区"
    },
    {
        "板块名字": "黄水",
        "行政区": "双流区"
    },
    {
        "板块名字": "火车北站",
        "行政区": "成华区"
    },
    {
        "板块名字": "机场路",
        "行政区": "高新南区"
    },
    {
        "板块名字": "机投",
        "行政区": "青羊区"
    },
    {
        "板块名字": "籍田",
        "行政区": "天府新区"
    },
    {
        "板块名字": "贾家",
        "行政区": "简阳市"
    },
    {
        "板块名字": "煎茶",
        "行政区": "天府新区"
    },
    {
        "板块名字": "简阳老城",
        "行政区": "简阳市"
    },
    {
        "板块名字": "简阳老工业园",
        "行政区": "简阳市"
    },
    {
        "板块名字": "简阳文教",
        "行政区": "简阳市"
    },
    {
        "板块名字": "江安",
        "行政区": "双流区"
    },
    {
        "板块名字": "蛟龙港",
        "行政区": "双流区"
    },
    {
        "板块名字": "街子",
        "行政区": "崇州市"
    },
    {
        "板块名字": "金花",
        "行政区": "武侯区"
    },
    {
        "板块名字": "金马",
        "行政区": "温江区"
    },
    {
        "板块名字": "金融城",
        "行政区": "高新南区"
    },
    {
        "板块名字": "金堂城区",
        "行政区": "金堂县"
    },
    {
        "板块名字": "金堂大学城",
        "行政区": "金堂县"
    },
    {
        "板块名字": "锦江工业园",
        "行政区": "锦江区"
    },
    {
        "板块名字": "锦江生态带",
        "行政区": "天府新区"
    },
    {
        "板块名字": "九江",
        "行政区": "双流区"
    },
    {
        "板块名字": "军屯",
        "行政区": "新都区"
    },
    {
        "板块名字": "科学城",
        "行政区": "天府新区"
    },
    {
        "板块名字": "科学城南",
        "行政区": "天府新区"
    },
    {
        "板块名字": "空港产业区",
        "行政区": "双流区"
    },
    {
        "板块名字": "空港新城",
        "行政区": "高新东区"
    },
    {
        "板块名字": "空天产业园",
        "行政区": "简阳市"
    },
    {
        "板块名字": "丽都",
        "行政区": "武侯区"
    },
    {
        "板块名字": "两河遗址",
        "行政区": "金牛区"
    },
    {
        "板块名字": "琉璃厂",
        "行政区": "锦江区"
    },
    {
        "板块名字": "柳林",
        "行政区": "温江区"
    },
    {
        "板块名字": "龙都北路",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "龙马湖",
        "行政区": "简阳市"
    },
    {
        "板块名字": "龙门山",
        "行政区": "彭州市"
    },
    {
        "板块名字": "龙桥",
        "行政区": "新都区"
    },
    {
        "板块名字": "龙泉城区",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "龙泉湖",
        "行政区": "简阳市"
    },
    {
        "板块名字": "龙泉山",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "龙潭寺",
        "行政区": "成华区"
    },
    {
        "板块名字": "鹿溪",
        "行政区": "天府新区"
    },
    {
        "板块名字": "麓湖",
        "行政区": "天府新区"
    },
    {
        "板块名字": "麓山",
        "行政区": "天府新区"
    },
    {
        "板块名字": "洛带",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "濛阳",
        "行政区": "彭州市"
    },
    {
        "板块名字": "木兰",
        "行政区": "新都区"
    },
    {
        "板块名字": "南部新区(彭州)",
        "行政区": "彭州市"
    },
    {
        "板块名字": "南中和",
        "行政区": "高新南区"
    },
    {
        "板块名字": "内光华",
        "行政区": "青羊区"
    },
    {
        "板块名字": "内金沙",
        "行政区": "青羊区"
    },
    {
        "板块名字": "欧洲产业城",
        "行政区": "青白江区"
    },
    {
        "板块名字": "攀成钢",
        "行政区": "锦江区"
    },
    {
        "板块名字": "彭镇",
        "行政区": "双流区"
    },
    {
        "板块名字": "彭州城区",
        "行政区": "彭州市"
    },
    {
        "板块名字": "彭州工业园",
        "行政区": "彭州市"
    },
    {
        "板块名字": "毗河",
        "行政区": "新都区"
    },
    {
        "板块名字": "郫县城区",
        "行政区": "郫都区"
    },
    {
        "板块名字": "平乐",
        "行政区": "邛崃市"
    },
    {
        "板块名字": "蒲江城区",
        "行政区": "蒲江县"
    },
    {
        "板块名字": "蒲江寿安",
        "行政区": "蒲江县"
    },
    {
        "板块名字": "普兴",
        "行政区": "新津区"
    },
    {
        "板块名字": "秦皇寺",
        "行政区": "天府新区"
    },
    {
        "板块名字": "青白江老城",
        "行政区": "青白江区"
    },
    {
        "板块名字": "青城山",
        "行政区": "都江堰市"
    },
    {
        "板块名字": "青龙湖",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "清流",
        "行政区": "新都区"
    },
    {
        "板块名字": "清水河片区",
        "行政区": "高新西区"
    },
    {
        "板块名字": "邛崃城区",
        "行政区": "邛崃市"
    },
    {
        "板块名字": "绕外高西区",
        "行政区": "高新西区"
    },
    {
        "板块名字": "人北片区",
        "行政区": "金牛区"
    },
    {
        "板块名字": "人南片区",
        "行政区": "武侯区"
    },
    {
        "板块名字": "三岔",
        "行政区": "高新东区"
    },
    {
        "板块名字": "三道堰",
        "行政区": "郫都区"
    },
    {
        "板块名字": "三圣乡",
        "行政区": "锦江区"
    },
    {
        "板块名字": "沙北",
        "行政区": "成华区"
    },
    {
        "板块名字": "沙西",
        "行政区": "金牛区"
    },
    {
        "板块名字": "十陵",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "石板滩",
        "行政区": "新都区"
    },
    {
        "板块名字": "书房",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "双流-牧马山",
        "行政区": "双流区"
    },
    {
        "板块名字": "双流北",
        "行政区": "双流区"
    },
    {
        "板块名字": "双流城区",
        "行政区": "双流区"
    },
    {
        "板块名字": "双流华府",
        "行政区": "双流区"
    },
    {
        "板块名字": "双流机场",
        "行政区": "双流区"
    },
    {
        "板块名字": "双楠片区",
        "行政区": "武侯区"
    },
    {
        "板块名字": "驷马桥",
        "行政区": "成华区"
    },
    {
        "板块名字": "太平",
        "行政区": "天府新区"
    },
    {
        "板块名字": "太平寺",
        "行政区": "武侯区"
    },
    {
        "板块名字": "泰兴",
        "行政区": "新都区"
    },
    {
        "板块名字": "唐昌",
        "行政区": "郫都区"
    },
    {
        "板块名字": "天府华府",
        "行政区": "天府新区"
    },
    {
        "板块名字": "天府生物城",
        "行政区": "双流区"
    },
    {
        "板块名字": "天府文创城",
        "行政区": "天府新区"
    },
    {
        "板块名字": "天府芯谷",
        "行政区": "双流区"
    },
    {
        "板块名字": "天府新站",
        "行政区": "天府新区"
    },
    {
        "板块名字": "天回",
        "行政区": "金牛区"
    },
    {
        "板块名字": "同安",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "桐梓林",
        "行政区": "武侯区"
    },
    {
        "板块名字": "团结",
        "行政区": "郫都区"
    },
    {
        "板块名字": "外光华",
        "行政区": "青羊区"
    },
    {
        "板块名字": "外金沙",
        "行政区": "青羊区"
    },
    {
        "板块名字": "外双楠",
        "行政区": "武侯区"
    },
    {
        "板块名字": "万安",
        "行政区": "天府新区"
    },
    {
        "板块名字": "万春",
        "行政区": "温江区"
    },
    {
        "板块名字": "万年场",
        "行政区": "成华区"
    },
    {
        "板块名字": "未来科技城",
        "行政区": "高新东区"
    },
    {
        "板块名字": "温江北",
        "行政区": "温江区"
    },
    {
        "板块名字": "温江城区",
        "行政区": "温江区"
    },
    {
        "板块名字": "温江寿安",
        "行政区": "温江区"
    },
    {
        "板块名字": "文产学院",
        "行政区": "双流区"
    },
    {
        "板块名字": "文家",
        "行政区": "青羊区"
    },
    {
        "板块名字": "五凤溪",
        "行政区": "简阳市"
    },
    {
        "板块名字": "武侯新城",
        "行政区": "武侯区"
    },
    {
        "板块名字": "西部智谷",
        "行政区": "武侯区"
    },
    {
        "板块名字": "西河",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "西平",
        "行政区": "龙泉驿区"
    },
    {
        "板块名字": "犀浦",
        "行政区": "郫都区"
    },
    {
        "板块名字": "新川",
        "行政区": "高新南区"
    },
    {
        "板块名字": "新都老城",
        "行政区": "新都区"
    },
    {
        "板块名字": "新都新城",
        "行政区": "新都区"
    },
    {
        "板块名字": "新繁",
        "行政区": "新都区"
    },
    {
        "板块名字": "新津-牧马山",
        "行政区": "新津区"
    },
    {
        "板块名字": "新津城区",
        "行政区": "新津区"
    },
    {
        "板块名字": "新津绿心",
        "行政区": "新津区"
    },
    {
        "板块名字": "新南天地",
        "行政区": "高新南区"
    },
    {
        "板块名字": "新兴产业园",
        "行政区": "天府新区"
    },
    {
        "板块名字": "兴隆",
        "行政区": "天府新区"
    },
    {
        "板块名字": "幸福梅林",
        "行政区": "锦江区"
    },
    {
        "板块名字": "熊猫基地",
        "行政区": "成华区"
    },
    {
        "板块名字": "羊安新城",
        "行政区": "邛崃市"
    },
    {
        "板块名字": "羊马新城",
        "行政区": "崇州市"
    },
    {
        "板块名字": "怡心湖",
        "行政区": "双流区"
    },
    {
        "板块名字": "营门口片区",
        "行政区": "金牛区"
    },
    {
        "板块名字": "永安",
        "行政区": "双流区"
    },
    {
        "板块名字": "永宁",
        "行政区": "温江区"
    },
    {
        "板块名字": "永商",
        "行政区": "新津区"
    },
    {
        "板块名字": "友爱",
        "行政区": "郫都区"
    },
    {
        "板块名字": "玉堂",
        "行政区": "都江堰市"
    },
    {
        "板块名字": "植物园",
        "行政区": "金牛区"
    }
]

let regionList = [
    '成华区',   '崇州市',   '大邑县',
    '都江堰市', '金牛区',   '金堂县',
    '锦江区',   '龙泉驿区', '彭州市',
    '蒲江县',   '青白江区', '青羊区',
    '双流区',   '温江区',   '武侯区',
    '新都区',   '新津县',   '邛崃市',
    '郫都区',   '简阳市','高新南区', '高新东区', '天府新区', '新津区', '高新西区',
  ]

let regionMap = {
    '成华区': [],
    '崇州市': [],
    '大邑县': [],
    '都江堰市': [],
    '金牛区': [],
    '金堂县': [],
    '锦江区': [],
    '龙泉驿区': [],
    '彭州市': [],
    '蒲江县': [],
    '青白江区': [],
    '青羊区': [],
    '双流区': [],
    '温江区': [],
    '武侯区': [],
    '新都区': [],
    '新津区': [],
    '邛崃市': [],
    '郫都区': [],
    '简阳市': [],
    '高新南区': [],
    '高新东区': [],
    '天府新区': [],
    '新津区': [],
    '高新西区': [],
  }

  map.forEach(item => {
    
    regionMap[item['行政区']].push({
        label: item['板块名字'],
        value: item['板块名字'],
    })
  })

console.log(regionMap);